In [33]:
%pip install seaborn
# conda install seaborn

Requirement already satisfied: seaborn in c:\김지은\파이썬_src\.venv\lib\site-packages (0.13.2)
Requirement already satisfied: numpy!=1.24.0,>=1.20 in c:\김지은\파이썬_src\.venv\lib\site-packages (from seaborn) (2.3.3)
Requirement already satisfied: pandas>=1.2 in c:\김지은\파이썬_src\.venv\lib\site-packages (from seaborn) (2.3.2)
Requirement already satisfied: matplotlib!=3.6.1,>=3.4 in c:\김지은\파이썬_src\.venv\lib\site-packages (from seaborn) (3.10.6)
Requirement already satisfied: contourpy>=1.0.1 in c:\김지은\파이썬_src\.venv\lib\site-packages (from matplotlib!=3.6.1,>=3.4->seaborn) (1.3.3)
Requirement already satisfied: cycler>=0.10 in c:\김지은\파이썬_src\.venv\lib\site-packages (from matplotlib!=3.6.1,>=3.4->seaborn) (0.12.1)
Requirement already satisfied: fonttools>=4.22.0 in c:\김지은\파이썬_src\.venv\lib\site-packages (from matplotlib!=3.6.1,>=3.4->seaborn) (4.60.0)
Requirement already satisfied: kiwisolver>=1.3.1 in c:\김지은\파이썬_src\.venv\lib\site-packages (from matplotlib!=3.6.1,>=3.4->seaborn) (1.4.9)
Requirement already satisfied: packaging>=20.0 in c:\김지은\파이썬_src\.venv\lib\site-packages (from matplotlib!=3.6.1,>=3.4->seaborn) (25.0)
Requirement already satisfied: pillow>=8 in c:\김지은\파이썬_src\.venv\lib\site-packages (from matplotlib!=3.6.1,>=3.4->seaborn) (11.3.0)
Requirement already satisfied: pyparsing>=2.3.1 in c:\김지은\파이썬_src\.venv\lib\site-packages (from matplotlib!=3.6.1,>=3.4->seaborn) (3.2.5)
Requirement already satisfied: python-dateutil>=2.7 in c:\김지은\파이썬_src\.venv\lib\site-packages (from matplotlib!=3.6.1,>=3.4->seaborn) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\김지은\파이썬_src\.venv\lib\site-packages (from pandas>=1.2->seaborn) (2025.2)
Requirement already satisfied: tzdata>=2022.7 in c:\김지은\파이썬_src\.venv\lib\site-packages (from pandas>=1.2->seaborn) (2025.2)
Requirement already satisfied: six>=1.5 in c:\김지은\파이썬_src\.venv\lib\site-packages (from python-dateutil>=2.7->matplotlib!=3.6.1,>=3.4->seaborn) (1.17.0)
Note: you may need to restart the kernel to use updated packages.

In [10]:
# 라이브러리 불러오기
import pandas as pd
import seaborn as sns

# # titanic 데이터셋 로딩
titanic = sns.load_dataset('titanic')
# titanic = sns.load_dataset('titanic').rename(columns={'sex':'gender'})
# 동일한 열종목들을 추려내기.  클래스 / 생존여부 / 성별 등

# 데이터프레임 출력
titanic.head(3)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True

In [13]:
titanic2 = titanic.copy()
# titanic2 = titanic2.drop('adult_male', axis = 1)
titanic2 = titanic2.drop(columns=['adult_male','pclass', 'alive', 'alone'])
#titanic2 = titanic2.drop(['adult_male','pclass', 'alive', 'alone'], axis = 1)
titanic2.head(3)

,survived,sex,age,sibsp,parch,fare,embarked,class,who,deck,embark_town
0,0,male,22.0,1,0,7.2500,S,Third,man,NaN,Southampton
1,1,female,38.0,1,0,71.2833,C,First,woman,C,Cherbourg
2,1,female,26.0,0,0,7.9250,S,Third,woman,NaN,Southampton

In [ ]:
# 1등석 2등석 3등석 pclass
# 선실별 승객수 len(데이터 프레임)

In [ ]:
# 1등석 2등석 3등석 pclass
titanic_class1 = titanic[titanic['pclass'] == 1]
titanic_class2 = titanic[titanic['pclass'] == 2]
titanic_class3 = titanic[titanic['pclass'] == 3]

216

In [ ]:
# 선실별 승객수 len(데이터 프레임)
print(f'1등석 승객수 : {len(titanic_class1)}\n2등석 승객수 : {len(titanic_class2)}\n3등석 승객수 : {len(titanic_class3)}\n전체 승객수 :{len(titanic_class1)+len(titanic_class2)+len(titanic_class3)}')

1등석 승객수 : 216
2등석 승객수 : 184
3등석 승객수 : 491
전체 승객수 :891

In [ ]:
titanic_class = pd.Series(
    [
    len(titanic_class1),
    len(titanic_class2),
    len(titanic_class3)
], index=['1등석', '2등석', '3등석'])
# titanic_class.value_counts()

# 전체 길이: len(s)
# NaN 제외한 개수: s.count()
# 각 값별 빈도: s.value_counts()
# 조건 만족 개수: (s > 조건).sum()

216    1
184    1
491    1
Name: count, dtype: int64

In [ ]:
import numpy as np
list_1 = np.array([1,2,3])
list_1[[True,False,True]]

array([1, 3])